{
  "ippon": {
    "title": "Ippon Technologies",
    "subtitle": "Consulting firm specialized in digital transformations.",
    "description": "Ippon is a consulting and expertise firm. It stated purpose is to \"help [their] clients leverage their digital assets to design an appropriate strategy and deploy their transformation roadmap at scale.\"."
  },
  "contentsquare": {
    "title": "ContentSquare",
    "subtitle": "Software as a service scale-up for web analytics.",
    "description": "ContentSquare is a digital experience analytics company. \"It's analytics platform provides rich and contextual insight into customer behaviors, feelings and intent — at every touch-point in their journey — enabling businesses to build empathy and create lasting impact\"."
  },
  "soprasteria": {
    "title": "Sopra Steria",
    "subtitle": "Consulting firm focused on end-to-end solutions for large companies and public sector institutions.",
    "description": "Sopra Steria is consulting firm. Known for their digital services and software development activities, Sopra Steria \"helps its clients drive their digital transformation and obtain tangible and sustainable benefits. It provides end-to-end solutions to make large companies and organisations more competitive by combining in-depth knowledge of a wide range of business sectors and innovative technologies with a fully collaborative approach.\""
  },
  "dga": {
    "title": "Direction générale de l'Armement (DGA)",
    "subtitle": "French Government defence procurement and technology agency within the Ministry of Armed Forces.",
    "description": "Public sector institution. The DGA is the \"French Government defence procurement and technology agency, responsible within the Ministry of Armed Forces for project management, development and purchase of weapon systems for the French military.\""
  },
  "sea": {
    "title": "Service de l'énergie opérationnelle (SEO)",
    "subtitle": "French inter-army institution in charge of oil procurement, supply, storage and distribution.",
    "description": "Previously the \"Service des essences des armées (SEA)\", the Service de l'énergie opérationnelle is the inter-army institution within the Ministry of Armed Forces in charge of all procurement, supply, storage and distribution of oil and petroleum products."
  },
  "mea": {
    "title": "Ministère des armées",
    "subtitle": "The Ministry in charge of managing the French Armed Forces.",
    "description": "The Ministry of Armed Forces is the ministry of the Government of France in charge of managing the French Armed Forces inside and outside French soil."
  },
  "hospinomics": {
    "title": "Hospinomics",
    "subtitle": "A research chair in partnership between the AP-HP and Paris School of Economics.",
    "description": "A research Chair created by the Assistance Publique-Hôpitaux de Paris (AP-HP) and Paris School of Economics (PSE), Hospinomics aims at brining together economists in order to develop evaluation strategies and experimental methods to optimize and maximize policies, decision-making, and resource allocation in the service of patients."
  },
  "pantheon_sorbonne": {
    "title": "University Paris I - Panthéon-Sorbonne",
    "subtitle": "Public research university focused on Economic Sciences, Human Sciences, and Legal and Political Sciences."
  },
  "paris_saclay": {
    "title": "Université Paris-Saclay",
    "subtitle": "The University of Paris-Saclay university innovation cluster brings together the university’s thirteen founding members with the common aim to create a leading pole in research and education."
  },
  "pse": {
    "title": "Paris School of Economics",
    "subtitle": "The Paris School of Economics is a French research institute in the field of economics."
  }
}
