{
  "side_trakt": {
    "description": {
      "title": "Side Trakt",
      "subtitle": "Vue 3 powered mv3 web extension",
      "description": "\"<b>Side Trakt</b>\" is a powerful Chrome extension designed to empowers users to effortlessly browse, track, and manage their trakt.tv shows and movies collections right from their web browser.\n\nHarnessing the power of Vue 3 and cutting-edge technologies like Pinia, Vite, and Vitest, Side Trakt delivers a sleek and responsive user interface, ensuring smooth navigation and intuitive interaction. Leveraging the Trakt.tv API for comprehensive movie and show data, along with the TMDB API for vibrant images, Side Trakt provides users with rich and up-to-date information about their favorite content.\n\nWhether you're organizing your watchlist, exploring trending titles, or discovering hidden gems, Side Trakt offers a seamless browsing experience tailored to your preferences. With its intuitive design and robust functionality, Side Trakt simplifies the process of managing your entertainment library, putting the power of trakt.tv at your fingertips."
    },
    "media": {
      "title": "Side Trakt",
      "subtitle": "Chrome extension for managing trakt.tv collections and lists",
      "link": {
        "label": "See it in the chrome store"
      }
    }
  },
  "synology_download": {
    "description": {
      "title": "Synology Download",
      "subtitle": "React powered mv3 web extension",
      "description": "\"<b>Synology Download</b>\" is a powerful Manifest V3 browser extension designed to simplify task and download management for Synology NAS users right from their web browsers. This versatile extension offers a range of useful features, including rapid task creation from various sources (links, URLs, media scraping, context menus, and rich modals), robust task management (play, pause, delete, seed, etc.), download interception capabilities (to transfer local download to the NAS), and flexible notification options (both in-browser and via push notifications). Moreover, users can fine-tune the extension's user interface to match their unique preferences with a wide array of customization options.\n\nBuilt on the React framework, this extension leverages a blend of components: a content script for injecting contextual UI elements like rich notifications and popup modals, a background script for hosting a persistent and synchronized Redux store, and a popup for displaying comprehensive task management features. By tapping into the rich Chrome API, the extension enables seamless background polling through an efficient system of message forwarding, data sharing, and state management.\n\nAs a dynamic testing ground for the React ecosystem, this extension harnesses popular tools such as webpack, Redux, RxJS, dnd-kit, Material UI, React Router, and many more."
    },
    "media": {
      "title": "Synology Download",
      "subtitle": "Chrome extension for managing Synology NAS",
      "link": {
        "label": "See it in the chrome store"
      }
    }
  },
  "about_me": {
    "description": {
      "title": "About Me",
      "subtitle": "Svelte powered lazy loaded micro-frontend",
      "description": "\"<b>About Me</b>\" is a micro-frontend that serves as an interactive showcase of my diverse projects, skills, and experiences. This website boasts beautiful animations and smooth transitions, offering a visually engaging display of my noteworthy GitHub projects and past professional endeavors.\n\nDesigned to seamlessly integrate into a host website, this package encapsulates its styling, scripts, and assets inside of a custom element. Thus it stands as a self-contained, lazily loaded web component, making it effortlessly embeddable within any website or deployable as a standalone entity. \n\nIt utilizes a modern tech stack, including Vite for speedy builds, D3.js to power dynamic data visualizations, and GitHub Actions to automate continuous integration and deployment. \n\nLeveraging the robust Svelte ecosystem, it excels in efficient code splitting and minimal runtime, ensuring a compact footprint and stellar performance.\n\nIt's conveniently hosted on a dedicated sub-domain, enabling straightforward inclusion within any codebase through a simple dynamic import of its remote entry file."
    },
    "media": {
      "title": "About Me",
      "subtitle": "Svelte powered interactive portfolio",
      "link": {
        "label": "See the code on github"
      }
    }
  },
  "dv_col": {
    "description": {
      "title": "Project Showcase",
      "subtitle": "SolidJs powered multi-framework shell",
      "description": "\"<b>dvcol.github.io</b>\" serves as a portfolio website, elegantly displaying my notable coding projects and their distinct features. This framework-agnostic shell acts as a versatile container for various lazy-loaded micro-frontends, each hosted in dedicated sub-domains.\n\nDriven by Solid.js, this platform guarantees minimal bundle size and exceptional performance. It encapsulates a series of web components, including a React-powered demo for \"<b>Synology-download</b>\", an interactive Svelte portfolio named \"<b>About-Me</b>\", and a Vue.js demo for \"<b>Side-Trakt</b>\". \n\nBuilt on the foundation of Motion One and Sass, the site presents a visually captivating animated UI and seamless page transitions, harmoniously merging diverse micro-frontends into a cohesive design.\n\nHarnessing the power of Vite and VitePWA, \"<b>dvcol.github.io</b>\" includes progressive web app functionalities, encompassing offline viewing, asset pre-caching, mobile installation, and rich notifications.\n\nDesigned as a dynamic, ever-evolving showcase, it utilizes GitHub Actions for continuous integration and deployment.\nLeveraging a service worker, updates are seamlessly delivered to users, ensuring an uninterrupted and responsive experience. Moreover, the platform champions an autonomous micro-frontend remote-entry system, enabling modular deployment of distinct components in an independent manner."
    },
    "media": {
      "title": "Project Showcase",
      "subtitle": "SolidJs powered project showcase",
      "link": {
        "label": "See the code on github"
      }
    }
  }
}
